In [2]:
import numpy as np 
A = [[1, 4, 8], [5, 7, 3], [9, 14, 2]]
np2=np.array(A)
np2
#np3=[]
#for i in range(0,np2.in)
#np3.append(np2[0][0]+np2[1][0]+np2[2][0])
#np

array([[ 1,  4,  8],
       [ 5,  7,  3],
       [ 9, 14,  2]])

In [8]:
mylist1=np.arange(20)
np4=mylist1.reshape(5,4)
type(np4)
np4

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [11]:
M = [[15, 17, 45, 56], [7, 42, 15, 63], [54, 3, 61, 41], [0, 87, 16, 20]]
np1=np.array(M)

np1

array([[15, 17, 45, 56],
       [ 7, 42, 15, 63],
       [54,  3, 61, 41],
       [ 0, 87, 16, 20]])

In [18]:
B = [[8, 7, 0, 9], [2, -3, 5, 10], [8, 5, -1,3]]
np1=np.array(B)
np1

array([[ 8,  7,  0,  9],
       [ 2, -3,  5, 10],
       [ 8,  5, -1,  3]])

In [19]:
np.split(np1,1)

[array([[ 8,  7,  0,  9],
        [ 2, -3,  5, 10],
        [ 8,  5, -1,  3]])]

In [26]:
data = [['Joy', 21], ['Mia', 15], ['Sam', 14]]
type(data)
import pandas as pd
df1=pd.DataFrame(data)
df1

     0   1
0  Joy  21
1  Mia  15
2  Sam  14

In [33]:
import pandas as pd
list1={'name':['Emma Larter','Mia Junior','Sophia deep','james smith'],'salary':[3200,4500,3600,5560]}
list1
df2=pd.DataFrame(list1)
df2

          name  salary
0  Emma Larter    3200
1   Mia Junior    4500
2  Sophia deep    3600
3  james smith    5560

In [36]:
 data = {
        'Name': ['Alice Johnson', 'Bob Smith', 'Charlie Brown', 'David Lee', 'Eva Williams'],
        'Age': [25, 32, 18, 47, 31],
        'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami'],
        'Salary': [50000, 65000, 40000, 80000, 55000]
    }

df = pd.DataFrame(data)
df

            Name  Age         City  Salary
0  Alice Johnson   25     New York   50000
1      Bob Smith   32  Los Angeles   65000
2  Charlie Brown   18      Chicago   40000
3      David Lee   47      Houston   80000
4   Eva Williams   31        Miami   55000